-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Oct 11, 2022 at 09:58 AM
-- Server version: 10.4.24-MariaDB
-- PHP Version: 8.1.6

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `dornica`
--

-- --------------------------------------------------------

--
-- Table structure for table `categories`
--

CREATE TABLE `categories` (
  `id` int(11) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `categories`
--

INSERT INTO `categories` (`id`, `name`) VALUES
(1, 'تکنولوژی'),
(2, 'اخبار');

-- --------------------------------------------------------

--
-- Table structure for table `cities`
--

CREATE TABLE `cities` (
  `id` int(10) UNSIGNED NOT NULL,
  `province_id` int(10) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `cities`
--

INSERT INTO `cities` (`id`, `province_id`, `name`) VALUES
(1, 1, 'تبريز'),
(2, 1, 'كندوان'),
(3, 1, 'بندر شرفخانه'),
(4, 1, 'مراغه'),
(5, 1, 'ميانه'),
(6, 1, 'شبستر'),
(7, 1, 'مرند'),
(8, 1, 'جلفا'),
(9, 1, 'سراب'),
(10, 1, 'هاديشهر'),
(11, 1, 'بناب'),
(12, 1, 'كليبر'),
(13, 1, 'تسوج'),
(14, 1, 'اهر'),
(15, 1, 'هريس'),
(16, 1, 'عجبشير'),
(17, 1, 'هشترود'),
(18, 1, 'ملكان'),
(19, 1, 'بستان آباد'),
(20, 1, 'ورزقان'),
(21, 1, 'اسكو'),
(22, 1, 'آذر شهر'),
(23, 1, 'قره آغاج'),
(24, 1, 'ممقان'),
(25, 1, 'صوفیان'),
(26, 1, 'ایلخچی'),
(27, 1, 'خسروشهر'),
(28, 1, 'باسمنج'),
(29, 1, 'سهند'),
(30, 2, 'اروميه'),
(31, 2, 'نقده'),
(32, 2, 'ماكو'),
(33, 2, 'تكاب'),
(34, 2, 'خوي'),
(35, 2, 'مهاباد'),
(36, 2, 'سر دشت'),
(37, 2, 'چالدران'),
(38, 2, 'بوكان'),
(39, 2, 'مياندوآب'),
(40, 2, 'سلماس'),
(41, 2, 'شاهين دژ'),
(42, 2, 'پيرانشهر'),
(43, 2, 'سيه چشمه'),
(44, 2, 'اشنويه'),
(45, 2, 'چایپاره'),
(46, 2, 'پلدشت'),
(47, 2, 'شوط'),
(48, 3, 'اردبيل'),
(49, 3, 'سرعين'),
(50, 3, 'بيله سوار'),
(51, 3, 'پارس آباد'),
(52, 3, 'خلخال'),
(53, 3, 'مشگين شهر'),
(54, 3, 'مغان'),
(55, 3, 'نمين'),
(56, 3, 'نير'),
(57, 3, 'كوثر'),
(58, 3, 'كيوي'),
(59, 3, 'گرمي'),
(60, 4, 'اصفهان'),
(61, 4, 'فريدن'),
(62, 4, 'فريدون شهر'),
(63, 4, 'فلاورجان'),
(64, 4, 'گلپايگان'),
(65, 4, 'دهاقان'),
(66, 4, 'نطنز'),
(67, 4, 'نايين'),
(68, 4, 'تيران'),
(69, 4, 'كاشان'),
(70, 4, 'فولاد شهر'),
(71, 4, 'اردستان'),
(72, 4, 'سميرم'),
(73, 4, 'درچه'),
(74, 4, 'کوهپایه'),
(75, 4, 'مباركه'),
(76, 4, 'شهرضا'),
(77, 4, 'خميني شهر'),
(78, 4, 'شاهين شهر'),
(79, 4, 'نجف آباد'),
(80, 4, 'دولت آباد'),
(81, 4, 'زرين شهر'),
(82, 4, 'آران و بيدگل'),
(83, 4, 'باغ بهادران'),
(84, 4, 'خوانسار'),
(85, 4, 'مهردشت'),
(86, 4, 'علويجه'),
(87, 4, 'عسگران'),
(88, 4, 'نهضت آباد'),
(89, 4, 'حاجي آباد'),
(90, 4, 'تودشک'),
(91, 4, 'ورزنه'),
(92, 6, 'ايلام'),
(93, 6, 'مهران'),
(94, 6, 'دهلران'),
(95, 6, 'آبدانان'),
(96, 6, 'شيروان چرداول'),
(97, 6, 'دره شهر'),
(98, 6, 'ايوان'),
(99, 6, 'سرابله'),
(100, 7, 'بوشهر'),
(101, 7, 'تنگستان'),
(102, 7, 'دشتستان'),
(103, 7, 'دير'),
(104, 7, 'ديلم'),
(105, 7, 'كنگان'),
(106, 7, 'گناوه'),
(107, 7, 'ريشهر'),
(108, 7, 'دشتي'),
(109, 7, 'خورموج'),
(110, 7, 'اهرم'),
(111, 7, 'برازجان'),
(112, 7, 'خارك'),
(113, 7, 'جم'),
(114, 7, 'کاکی'),
(115, 7, 'عسلویه'),
(116, 7, 'بردخون'),
(117, 8, 'تهران'),
(118, 8, 'ورامين'),
(119, 8, 'فيروزكوه'),
(120, 8, 'ري'),
(121, 8, 'دماوند'),
(122, 8, 'اسلامشهر'),
(123, 8, 'رودهن'),
(124, 8, 'لواسان'),
(125, 8, 'بومهن'),
(126, 8, 'تجريش'),
(127, 8, 'فشم'),
(128, 8, 'كهريزك'),
(129, 8, 'پاكدشت'),
(130, 8, 'چهاردانگه'),
(131, 8, 'شريف آباد'),
(132, 8, 'قرچك'),
(133, 8, 'باقرشهر'),
(134, 8, 'شهريار'),
(135, 8, 'رباط كريم'),
(136, 8, 'قدس'),
(137, 8, 'ملارد'),
(138, 9, 'شهركرد'),
(139, 9, 'فارسان'),
(140, 9, 'بروجن'),
(141, 9, 'چلگرد'),
(142, 9, 'اردل'),
(143, 9, 'لردگان'),
(144, 9, 'سامان'),
(145, 10, 'قائن'),
(146, 10, 'فردوس'),
(147, 10, 'بيرجند'),
(148, 10, 'نهبندان'),
(149, 10, 'سربيشه'),
(150, 10, 'طبس مسینا'),
(151, 10, 'قهستان'),
(152, 10, 'درمیان'),
(153, 11, 'مشهد'),
(154, 11, 'نيشابور'),
(155, 11, 'سبزوار'),
(156, 11, 'كاشمر'),
(157, 11, 'گناباد'),
(158, 11, 'طبس'),
(159, 11, 'تربت حيدريه'),
(160, 11, 'خواف'),
(161, 11, 'تربت جام'),
(162, 11, 'تايباد'),
(163, 11, 'قوچان'),
(164, 11, 'سرخس'),
(165, 11, 'بردسكن'),
(166, 11, 'فريمان'),
(167, 11, 'چناران'),
(168, 11, 'درگز'),
(169, 11, 'كلات'),
(170, 11, 'طرقبه'),
(171, 11, 'سر ولایت'),
(172, 12, 'بجنورد'),
(173, 12, 'اسفراين'),
(174, 12, 'جاجرم'),
(175, 12, 'شيروان'),
(176, 12, 'آشخانه'),
(177, 12, 'گرمه'),
(178, 12, 'ساروج'),
(179, 13, 'اهواز'),
(180, 13, 'ايرانشهر'),
(181, 13, 'شوش'),
(182, 13, 'آبادان'),
(183, 13, 'خرمشهر'),
(184, 13, 'مسجد سليمان'),
(185, 13, 'ايذه'),
(186, 13, 'شوشتر'),
(187, 13, 'انديمشك'),
(188, 13, 'سوسنگرد'),
(189, 13, 'هويزه'),
(190, 13, 'دزفول'),
(191, 13, 'شادگان'),
(192, 13, 'بندر ماهشهر'),
(193, 13, 'بندر امام خميني'),
(194, 13, 'اميديه'),
(195, 13, 'بهبهان'),
(196, 13, 'رامهرمز'),
(197, 13, 'باغ ملك'),
(198, 13, 'هنديجان'),
(199, 13, 'لالي'),
(200, 13, 'رامشیر'),
(201, 13, 'حمیدیه'),
(202, 13, 'دغاغله'),
(203, 13, 'ملاثانی'),
(204, 13, 'شادگان'),
(205, 13, 'ویسی'),
(206, 14, 'زنجان'),
(207, 14, 'ابهر'),
(208, 14, 'خدابنده'),
(209, 14, 'كارم'),
(210, 14, 'ماهنشان'),
(211, 14, 'خرمدره'),
(212, 14, 'ايجرود'),
(213, 14, 'زرين آباد'),
(214, 14, 'آب بر'),
(215, 14, 'قيدار'),
(216, 15, 'سمنان'),
(217, 15, 'شاهرود'),
(218, 15, 'گرمسار'),
(219, 15, 'ايوانكي'),
(220, 15, 'دامغان'),
(221, 15, 'بسطام'),
(222, 16, 'زاهدان'),
(223, 16, 'چابهار'),
(224, 16, 'خاش'),
(225, 16, 'سراوان'),
(226, 16, 'زابل'),
(227, 16, 'سرباز'),
(228, 16, 'نيكشهر'),
(229, 16, 'ايرانشهر'),
(230, 16, 'راسك'),
(231, 16, 'ميرجاوه'),
(232, 17, 'شيراز'),
(233, 17, 'اقليد'),
(234, 17, 'داراب'),
(235, 17, 'فسا'),
(236, 17, 'مرودشت'),
(237, 17, 'خرم بيد'),
(238, 17, 'آباده'),
(239, 17, 'كازرون'),
(240, 17, 'ممسني'),
(241, 17, 'سپيدان'),
(242, 17, 'لار'),
(243, 17, 'فيروز آباد'),
(244, 17, 'جهرم'),
(245, 17, 'ني ريز'),
(246, 17, 'استهبان'),
(247, 17, 'لامرد'),
(248, 17, 'مهر'),
(249, 17, 'حاجي آباد'),
(250, 17, 'نورآباد'),
(251, 17, 'اردكان'),
(252, 17, 'صفاشهر'),
(253, 17, 'ارسنجان'),
(254, 17, 'قيروكارزين'),
(255, 17, 'سوريان'),
(256, 17, 'فراشبند'),
(257, 17, 'سروستان'),
(258, 17, 'ارژن'),
(259, 17, 'گويم'),
(260, 17, 'داريون'),
(261, 17, 'زرقان'),
(262, 17, 'خان زنیان'),
(263, 17, 'کوار'),
(264, 17, 'ده بید'),
(265, 17, 'باب انار/خفر'),
(266, 17, 'بوانات'),
(267, 17, 'خرامه'),
(268, 17, 'خنج'),
(269, 17, 'سیاخ دارنگون'),
(270, 18, 'قزوين'),
(271, 18, 'تاكستان'),
(272, 18, 'آبيك'),
(273, 18, 'بوئين زهرا'),
(274, 19, 'قم'),
(275, 5, 'طالقان'),
(276, 5, 'نظرآباد'),
(277, 5, 'اشتهارد'),
(278, 5, 'هشتگرد'),
(279, 5, 'كن'),
(280, 5, 'آسارا'),
(281, 5, 'شهرک گلستان'),
(282, 5, 'اندیشه'),
(283, 5, 'كرج'),
(284, 5, 'نظر آباد'),
(285, 5, 'گوهردشت'),
(286, 5, 'ماهدشت'),
(287, 5, 'مشکین دشت'),
(288, 20, 'سنندج'),
(289, 20, 'ديواندره'),
(290, 20, 'بانه'),
(291, 20, 'بيجار'),
(292, 20, 'سقز'),
(293, 20, 'كامياران'),
(294, 20, 'قروه'),
(295, 20, 'مريوان'),
(296, 20, 'صلوات آباد'),
(297, 20, 'حسن آباد'),
(298, 21, 'كرمان'),
(299, 21, 'راور'),
(300, 21, 'بابك'),
(301, 21, 'انار'),
(302, 21, 'کوهبنان'),
(303, 21, 'رفسنجان'),
(304, 21, 'بافت'),
(305, 21, 'سيرجان'),
(306, 21, 'كهنوج'),
(307, 21, 'زرند'),
(308, 21, 'بم'),
(309, 21, 'جيرفت'),
(310, 21, 'بردسير'),
(311, 22, 'كرمانشاه'),
(312, 22, 'اسلام آباد غرب'),
(313, 22, 'سر پل ذهاب'),
(314, 22, 'كنگاور'),
(315, 22, 'سنقر'),
(316, 22, 'قصر شيرين'),
(317, 22, 'گيلان غرب'),
(318, 22, 'هرسين'),
(319, 22, 'صحنه'),
(320, 22, 'پاوه'),
(321, 22, 'جوانرود'),
(322, 22, 'شاهو'),
(323, 23, 'ياسوج'),
(324, 23, 'گچساران'),
(325, 23, 'دنا'),
(326, 23, 'دوگنبدان'),
(327, 23, 'سي سخت'),
(328, 23, 'دهدشت'),
(329, 23, 'ليكك'),
(330, 24, 'گرگان'),
(331, 24, 'آق قلا'),
(332, 24, 'گنبد كاووس'),
(333, 24, 'علي آباد كتول'),
(334, 24, 'مينو دشت'),
(335, 24, 'تركمن'),
(336, 24, 'كردكوي'),
(337, 24, 'بندر گز'),
(338, 24, 'كلاله'),
(339, 24, 'آزاد شهر'),
(340, 24, 'راميان'),
(341, 25, 'رشت'),
(342, 25, 'منجيل'),
(343, 25, 'لنگرود'),
(344, 25, 'رود سر'),
(345, 25, 'تالش'),
(346, 25, 'آستارا'),
(347, 25, 'ماسوله'),
(348, 25, 'آستانه اشرفيه'),
(349, 25, 'رودبار'),
(350, 25, 'فومن'),
(351, 25, 'صومعه سرا'),
(352, 25, 'بندرانزلي'),
(353, 25, 'كلاچاي'),
(354, 25, 'هشتپر'),
(355, 25, 'رضوان شهر'),
(356, 25, 'ماسال'),
(357, 25, 'شفت'),
(358, 25, 'سياهكل'),
(359, 25, 'املش'),
(360, 25, 'لاهیجان'),
(361, 25, 'خشک بيجار'),
(362, 25, 'خمام'),
(363, 25, 'لشت نشا'),
(364, 25, 'بندر کياشهر'),
(365, 26, 'خرم آباد'),
(366, 26, 'ماهشهر'),
(367, 26, 'دزفول'),
(368, 26, 'بروجرد'),
(369, 26, 'دورود'),
(370, 26, 'اليگودرز'),
(371, 26, 'ازنا'),
(372, 26, 'نور آباد'),
(373, 26, 'كوهدشت'),
(374, 26, 'الشتر'),
(375, 26, 'پلدختر'),
(376, 27, 'ساري'),
(377, 27, 'آمل'),
(378, 27, 'بابل'),
(379, 27, 'بابلسر'),
(380, 27, 'بهشهر'),
(381, 27, 'تنكابن'),
(382, 27, 'جويبار'),
(383, 27, 'چالوس'),
(384, 27, 'رامسر'),
(385, 27, 'سواد كوه'),
(386, 27, 'قائم شهر'),
(387, 27, 'نكا'),
(388, 27, 'نور'),
(389, 27, 'بلده'),
(390, 27, 'نوشهر'),
(391, 27, 'پل سفيد'),
(392, 27, 'محمود آباد'),
(393, 27, 'فريدون كنار'),
(394, 28, 'اراك'),
(395, 28, 'آشتيان'),
(396, 28, 'تفرش'),
(397, 28, 'خمين'),
(398, 28, 'دليجان'),
(399, 28, 'ساوه'),
(400, 28, 'سربند'),
(401, 28, 'محلات'),
(402, 28, 'شازند'),
(403, 29, 'بندرعباس'),
(404, 29, 'قشم'),
(405, 29, 'كيش'),
(406, 29, 'بندر لنگه'),
(407, 29, 'بستك'),
(408, 29, 'حاجي آباد'),
(409, 29, 'دهبارز'),
(410, 29, 'انگهران'),
(411, 29, 'ميناب'),
(412, 29, 'ابوموسي'),
(413, 29, 'بندر جاسك'),
(414, 29, 'تنب بزرگ'),
(415, 29, 'بندر خمیر'),
(416, 29, 'پارسیان'),
(417, 29, 'قشم'),
(418, 30, 'همدان'),
(419, 30, 'ملاير'),
(420, 30, 'تويسركان'),
(421, 30, 'نهاوند'),
(422, 30, 'كبودر اهنگ'),
(423, 30, 'رزن'),
(424, 30, 'اسدآباد'),
(425, 30, 'بهار'),
(426, 31, 'يزد'),
(427, 31, 'تفت'),
(428, 31, 'اردكان'),
(429, 31, 'ابركوه'),
(430, 31, 'ميبد'),
(431, 31, 'طبس'),
(432, 31, 'بافق'),
(433, 31, 'مهريز'),
(434, 31, 'اشكذر'),
(435, 31, 'هرات'),
(436, 31, 'خضرآباد'),
(437, 31, 'شاهديه'),
(438, 31, 'حمیدیه شهر'),
(439, 31, 'سید میرزا'),
(440, 31, 'زارچ');

-- --------------------------------------------------------

--
-- Table structure for table `logs`
--

CREATE TABLE `logs` (
  `id` int(11) UNSIGNED NOT NULL,
  `operation` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `date` date NOT NULL,
  `member_username` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `description` text COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `logs`
--

INSERT INTO `logs` (`id`, `operation`, `date`, `member_username`, `description`) VALUES
(6, 'update', '1401-07-17', 'sara', 'member password was changed'),
(7, 'update', '1401-07-17', 'sara', 'Member password was changed'),
(8, 'update', '1401-07-18', 'sara', 'member fields was updated'),
(9, 'update', '1401-07-18', 'sara', 'member fields was updated'),
(10, 'update', '1401-07-18', 'sara', 'member fields was updated'),
(11, 'delete', '1401-07-18', 'sara', '\' is deleted by manager'),
(12, 'update', '1401-07-18', 'sara', 'member fields was updated'),
(13, 'update', '1401-07-18', 'sara', 'member fields was updated'),
(14, 'update', '1401-07-18', 'sara', 'member fields was updated'),
(15, 'update', '1401-07-18', 'sara', 'member fields was updated'),
(16, 'update', '1401-07-18', 'sara', 'member fields was updated'),
(17, 'update', '1401-07-18', 'sara', 'member fields was updated'),
(18, 'update', '1401-07-18', 'ali', 'member fields was updated'),
(19, 'update', '1401-07-18', 'ali', 'Member info was updated'),
(20, 'update', '1401-07-18', 'ali', 'Member info was updated'),
(21, 'update', '1401-07-18', 'sara', 'Member password was changed'),
(22, 'update', '1401-07-18', 'sara', 'Member password was changed'),
(23, 'update', '1401-07-18', 'sara', 'Member info was updated'),
(24, 'update', '1401-07-18', 'ali', 'Member info was updated'),
(25, 'update', '1401-07-18', 'sara', 'Member verified column changed to 1 (true)'),
(26, 'update', '1401-07-18', 'sara', 'Member verified column changed to 1 (true)'),
(27, 'update', '1401-07-18', 'sara', 'New vkey set for current member'),
(28, 'insert', '1401-07-18', 'keyvan', 'New member added to members'),
(29, 'update', '1401-07-18', 'keyvan', 'Member verified column changed to 1 (true)'),
(30, 'insert', '1401-07-18', 'mehri', 'New member added to members'),
(31, 'update', '1401-07-18', 'mehri', 'Member verified column changed to 1 (true)'),
(32, 'update', '1401-07-18', 'sara', 'Manager converted a reader member to author'),
(33, 'update', '1401-07-18', 'sara', 'Manager converted a reader member to author'),
(34, 'update', '1401-07-18', 'sara', 'Manager converted an author member to manager'),
(35, 'update', '1401-07-18', 'sara', 'Manager converted an author member to manager'),
(36, 'update', '1401-07-18', 'sara', 'Manager converted a manager member to author'),
(37, 'update', '1401-07-18', 'sara', 'Manager converted an author member to manager'),
(38, 'update', '1401-07-18', 'sara', 'Manager converted an author member to manager'),
(39, 'update', '1401-07-18', 'sara', 'Manager converted a reader member to author'),
(40, 'update', '1401-07-18', 'sara', 'Manager converted an author member to reader'),
(41, 'update', '1401-07-18', 'sara', 'Manager converted an author member to manager'),
(42, 'update', '1401-07-18', 'sara', 'Manager converted a manager member to author'),
(43, 'update', '1401-07-18', 'sara', 'Manager converted an author member to manager'),
(44, 'update', '1401-07-18', 'sara', 'Manager converted a manager member to author'),
(45, 'delete', '1401-07-18', 'sara', 'Manager deleted a member'),
(46, 'update', '1401-07-19', 'sara', 'Member info was updated'),
(47, 'insert', '1401-07-19', 'mahshid', 'New member added to members'),
(48, 'update', '1401-07-19', 'mahshid', 'Member verified column changed to 1 (true)'),
(49, 'insert', '1401-07-19', 'yashar', 'New member added to members'),
(50, 'update', '1401-07-19', 'yashar', 'Member verified column changed to 1 (true)'),
(51, 'update', '1401-07-19', 'yashar', 'Member info was updated');

-- --------------------------------------------------------

--
-- Table structure for table `members`
--

CREATE TABLE `members` (
  `id` int(11) NOT NULL,
  `first_name` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `last_name` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `nation_code` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `phone_number` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `birth_date` date DEFAULT NULL,
  `gender` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `military` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `email` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `image` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `username` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `password` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `province` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `city` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `membership_date` date NOT NULL,
  `vkey` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `verified` tinyint(255) NOT NULL DEFAULT 0,
  `member_type_id` tinyint(4) NOT NULL DEFAULT 3
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `members`
--

INSERT INTO `members` (`id`, `first_name`, `last_name`, `nation_code`, `phone_number`, `birth_date`, `gender`, `military`, `email`, `image`, `username`, `password`, `province`, `city`, `membership_date`, `vkey`, `verified`, `member_type_id`) VALUES
(8, 'سارا', 'طیبی', '2080872613', '09114445555', '1374-01-24', 'female', '', 'fzkworks@gmail.com', 'assets/images/istockphoto-1299077582-170667a.jpg', 'sara', '202cb962ac59075b964b07152d234b70', '12', '175', '1401-07-12', '2572', 1, 1),
(9, 'علی', 'طیبی', '2091874035', '09114446666', '1356-01-09', 'male', 'medical-exemption', 'fzkworks@gmail.com', 'assets/images/istockphoto-1290528178-170667a.jpg', 'ali', '202cb962ac59075b964b07152d234b70', '16', '226', '1401-07-12', '4352', 1, 2),
(13, 'امیر', 'محمدی', '2080774409', '09123431213', '1380-10-05', 'male', 'medical-exemption', 'fzkworks@gmail.com', 'assets/images/default.jpg', 'amir', '202cb962ac59075b964b07152d234b70', NULL, NULL, '2022-10-09', '3456', 1, 3),
(18, 'امیر', 'امیری', '0205888941', '09871231212', '0000-00-00', 'male', 'finished', 'fzkworks@gmail.lcom', 'assets/images/istockphoto-1152601910-170667a.jpg', 'amir2', '202cb962ac59075b964b07152d234b70', '12', '173', '1401-07-18', '4615', 1, 2),
(19, 'ماریا', 'خرمی', '0169673758', '09112334343', '0000-00-00', 'female', '', 'fzkworks@gmail.com', 'assets/images/istockphoto-1177546833-170667a.jpg', 'maria', '202cb962ac59075b964b07152d234b70', '6', '93', '1401-07-18', '2704', 1, 3),
(20, 'کیوان', 'قاسمی', '0520423909', '09161665533', '1329-01-14', 'male', 'permanent-exemption', 'fzkworks@gmail.com', 'assets/images/istockphoto-1178153068-170667a.jpg', 'keyvan', '202cb962ac59075b964b07152d234b70', '16', NULL, '1401-07-18', '6147', 1, 3),
(21, 'مهری', 'احمدی', '0444108351', '09111434343', '1364-07-21', 'female', '', 'fzkworks@gmail.com', 'assets/images/istockphoto-1301953681-170667a.jpg', 'mehri', '202cb962ac59075b964b07152d234b70', '12', NULL, '1401-07-18', '2628', 1, 2),
(22, 'مهشید', 'لنگری', '0292068328', '09117774455', '0000-00-00', 'female', '', 'fzkworks@gmail.com', 'assets/images/istockphoto-1386479313-170667a.jpg', 'mahshid', '202cb962ac59075b964b07152d234b70', '18', '270', '1401-07-19', '9315', 1, 3),
(23, 'یاشار', 'شاهینی', '0195256743', '09331234323', '1365-08-27', 'male', 'temporary-exemption', 'fzkworks@gmail.com', 'assets/images/istockphoto-1171169127-170667a.jpg', 'yashar', '202cb962ac59075b964b07152d234b70', '9', '143', '1401-07-19', '9492', 1, 3);

-- --------------------------------------------------------

--
-- Table structure for table `permissions`
--

CREATE TABLE `permissions` (
  `id` int(11) NOT NULL,
  `type` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `full_admin` tinyint(4) NOT NULL DEFAULT 0,
  `posts_managing` tinyint(4) NOT NULL DEFAULT 0,
  `posts_reading` tinyint(4) NOT NULL DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `permissions`
--

INSERT INTO `permissions` (`id`, `type`, `full_admin`, `posts_managing`, `posts_reading`) VALUES
(1, 'manager', 1, 1, 1),
(2, 'author', 0, 1, 1),
(3, 'reader', 0, 0, 1);

-- --------------------------------------------------------

--
-- Table structure for table `posts`
--

CREATE TABLE `posts` (
  `id` int(11) NOT NULL,
  `title` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `category` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `author_id` int(11) NOT NULL,
  `image` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `description` text COLLATE utf8_unicode_ci NOT NULL,
  `reading_time` varchar(255) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `posts`
--

INSERT INTO `posts` (`id`, `title`, `category`, `author_id`, `image`, `description`, `reading_time`) VALUES
(2, 'کاربرد بهینه سازی وب سایت و نحوه کارکرد', 'اخبار', 9, 'assets/post_images/business-man-standing-window-office-technology-layer-effect-working-46228329.jpg', 'اگر کار بهینه سازی موتور جستجو یا سئو (SEO) را به خوبی انجام دهید ، مراجعه مشتریان به سایت شما به طور قابل توجهی افزایش خواهد یافت. اما تنها بهینه سازی موتور جستجو و افزایش آمار بازدید کنندگان سایت کافی نیست. اگر فقط تعداد بازدیدکنندگان سایت خود را افزایش دهید و محتوای سایت شما مورد توجه مشتریان بالقوه قرار نگیرد ، هیچ نتیجه مثبتی به دست نمی آورید. اگر محتوای سایت خوب نباشد، بازدیدکنندگان بدون اینکه خریدی داشته باشند سایت شما را ترک می کنند و هرگز بازنمی گردند. پس برای استفاده از ترافیکی که متوجه سایتتان میشود ، باید کاری کنید که محتوای سایتتان مورد توجه کاربران قرار بگیرد. همچنین لازم است که کارایی قیف های تبدیل (CONVERSION) خود را نیز بهینه کنید.', '1'),
(3, 'بهینه سازی سایت | تکنیک برای رسیدن به صفحه اول گوگل', 'تکنولوژی', 8, 'assets/post_images/TRANSLATE.jpg', 'بهینه سازی سایت فرایندی است که طی آن از ابزارها، استراتژی های پیشرفته و آزمون های گوناگون استفاده می‌شود تا عملکرد یک وبسایت بهبود پیدا کند، ترافیک آن وبسایت بیشتر شود، تبدیل ها (conversions) افزایش پیدا کنند و درآمد حاصل از آن وبسایت رشد داشته باشد.\r\n\r\nیکی از مهمترین جنبه های بهینه سازی سایت، بهینه سازی موتور جستجو (search engine optimization) یا همان سئو (SEO) است. این تکنیک نه تنها بر صفحات گوناگون سایت تمرکز می کند تا برای کلیدواژه های گوناگون، رتبه بهتری را در صفحه نتایج جستجو (SERP) به دست آورند، بلکه به مشتریان بالقوه کمک می کند تا به آسانی برند شما را پیدا کنند. یک جنبه مهم دیگر بهینه سازی داخلی صفحات است. این تکنیک کمک می کند تا مشتریان بالقوه به وبسایت شما وارد شوند، سایت شما را بپسندند و به احتمال زیاد به یک مشتری بالفعل تبدیل شوند.\r\n\r\nبنابراین، با بهینه سازی وب سایت خود ، نه تنها می توانید به شیوه ای کارآمد (بدون پرداخت هزینه برای تبلیغات) وارد بازار شوید، بلکه خواهید توانست بازدید کنندگان از سایت تان را به مشتری های جدید تبدیل کنید و درآمد خود را افزایش دهید. با این حال باید توجه داشته باشید که اگرچه سئو بخشی اساسی و مهمی در بهینه سازی وب سایت است، اما همه چیز نیست.\r\n\r\nبهینه سازی وب سایت برای افراد (نه صرفا برای موتورهای جستجو) به شما کمک می کند تا اعتماد بازدید کنندگان از سایت خود را جلب کنید. به این ترتیب می توانید با این افراد رابطه برقرار کنید و این امر به شما این امکان را خواهد داد که محصولات خود را بدون نیاز به تبلیغات، ارسال ایمیل یا تماس تلفنی بفروشید.\r\n\r\nرویکردی را برای بهینه سازی وب سایت می توانیم جامع و کامل بدانیم که از ترکیبی از راهکارهای مختلف برای حصول اطمینان از عملکرد ایده آل وب سایت استفاده کرده باشد. مهمترین راهکارها عبارتند از:\r\n\r\nسئو\r\nکپی رایتینگ (نوشتن متن یا تولید محتوا)\r\nتجزیه و تحلیل\r\nطراحی UX\r\nتوسعه وب (Backend)\r\nبهینه سازی صفحات سایت\r\nبهینه سازی نرخ تبدیل (CRO)\r\nچرا بهینه سازی وب سایت مهم است؟', '2'),
(4, 'چگونه پست وبلاگ بنویسیم ؛ آموزش جامع وبلاگ نویسی', 'بلاگ نویسی', 9, 'assets/post_images/hr-learn20-gpstrategies-thumb.jpg', 'پست وبلاگ و بلاگ‌نویسی برای افراد و کسب‌وکارها مزایای زیادی دارد. اما چگونه پست بلاگی بنویسیم که بهترین باشد؟ در این مطلب آموزش جامع وبلاگ‌نویسی در انتظار شماست.\r\nنوشتن پست بلاگ مانند یادگیری رانندگی است. شاید شما قواعد رانندگی و راهنمای آیین نامه را بدانید، اما نمی‌توانید رانندگی کنید؛ چراکه باید تمرین و تکرار داشته باشید تا به صورت حرفه‌ای از پس این کار برآیید.\r\nشاید آموزش‌های مختلفی را در وب‌سایت‌های دیگر برای یادگیری وبلاگ نویسی دیده باشید؛ ولی ما در این مطلب آموزش جامع وبلاگ نویسی را به شما ارائه می‌کنیم.\r\nوبلاگ نویسی چیست؟\r\nممکن است نوشتن برای شما نوعی سرگرمی باشد و از نویسندگی لذت ببرید، اما پیش از هر چیز باید بدانید که نوشتن پست وبلاگ برای کسب‌وکارها ممکن است کمتر لذت‌بخش باشد و گاهی به کاری سخت و تکراری تبدیل شود. ضمن اینکه باید به نرخ تبدیل سایت شما کمک کند و در راستای برنامه‌های مارکتینگ باشد.\r\nاین پست به نوعی از نوشته اطلاق می‌شود که در آن می‌توانید درباره تفکرات، آمارها و داستان‌های مربوط به موضوعی خاص روی وبسایتتان مطالبی را بنویسید.\r\nپست‌های وبلاگی به شما کمک می‌کنند ترافیک سایتتان را افزایش دهید، آگاهی بخشی کنید، اعتبارتان را بیشتر کرده، مشتریان بالقوه را به مشتریان بالفعل تبدیل کنید و نهایتا به درآمد برسید.\r\nامروزه افراد برای مقاصد مختلفی از بلاگ‌ها استفاده می‌کنند، انتقاد می‌کنند، نظراتشان را می‌نویسند، تحلیل ارائه می‌کنند، درباره محصولی اطلاعات می‌دهند، یافته‌های صنعتشان را می‌نویسند و آن‌ها را در قالب‌های مختلفی منتشر می‌کنند.', '2'),
(5, 'بهینه سازی سایت چیست؟', 'تکنولوژی', 8, 'assets/post_images/20210326trends.jpg', 'بهینه سازی سایت فرایندی است که طی آن از ابزارها، استراتژی های پیشرفته و آزمون های گوناگون استفاده می‌شود تا عملکرد یک وبسایت بهبود پیدا کند، ترافیک آن وبسایت بیشتر شود، تبدیل ها (conversions) افزایش پیدا کنند و درآمد حاصل از آن وبسایت رشد داشته باشد.\r\n\r\nیکی از مهمترین جنبه های بهینه سازی سایت، بهینه سازی موتور جستجو (search engine optimization) یا همان سئو (SEO) است. این تکنیک نه تنها بر صفحات گوناگون سایت تمرکز می کند تا برای کلیدواژه های گوناگون، رتبه بهتری را در صفحه نتایج جستجو (SERP) به دست آورند، بلکه به مشتریان بالقوه کمک می کند تا به آسانی برند شما را پیدا کنند. یک جنبه مهم دیگر بهینه سازی داخلی صفحات است. این تکنیک کمک می کند تا مشتریان بالقوه به وبسایت شما وارد شوند، سایت شما را بپسندند و به احتمال زیاد به یک مشتری بالفعل تبدیل شوند.\r\n\r\nبنابراین، با بهینه سازی وب سایت خود ، نه تنها می توانید به شیوه ای کارآمد (بدون پرداخت هزینه برای تبلیغات) وارد بازار شوید، بلکه خواهید توانست بازدید کنندگان از سایت تان را به مشتری های جدید تبدیل کنید و درآمد خود را افزایش دهید. با این حال باید توجه داشته باشید که اگرچه سئو بخشی اساسی و مهمی در بهینه سازی وب سایت است، اما همه چیز نیست.\r\n\r\nبهینه سازی وب سایت برای افراد (نه صرفا برای موتورهای جستجو) به شما کمک می کند تا اعتماد بازدید کنندگان از سایت خود را جلب کنید. به این ترتیب می توانید با این افراد رابطه برقرار کنید و این امر به شما این امکان را خواهد داد که محصولات خود را بدون نیاز به تبلیغات، ارسال ایمیل یا تماس تلفنی بفروشید.\r\n\r\nرویکردی را برای بهینه سازی وب سایت می توانیم جامع و کامل بدانیم که از ترکیبی از راهکارهای مختلف برای حصول اطمینان از عملکرد ایده آل وب سایت استفاده کرده باشد. مهمترین راهکارها عبارتند از:\r\n\r\nسئو\r\nکپی رایتینگ (نوشتن متن یا تولید محتوا)\r\nتجزیه و تحلیل\r\nطراحی UX\r\nتوسعه وب (Backend)\r\nبهینه سازی صفحات سایت\r\nبهینه سازی نرخ تبدیل (CRO)\r\nچرا بهینه سازی وب سایت مهم است؟\r\nچرا بهینه سازی وب سایت مهم است؟\r\nچرا بهینه سازی وب سایت مهم است؟\r\nطی چند سال گذشته، اینترنت به وسیله ای مهم و سرنوشت ساز برای تصمیم گیری مصرف کنندگان تبدیل شده است. آنها با استفاده از اینترنت کالاها و خدمات مورد نظر خود را انتخاب و خریداری می کنند. در سال 2019، فروش جهانی در حیطه تجارت الکترونیکی به بیش از 3.46 تریلیون دلار رسید، که این مبلغ 16.4٪ از کل درآمد خرده فروشی در سراسر جهان را تشکیل می دهد.\r\n\r\nاینترنت همچنین به مقصد اصلی افراد برای یافتن اطلاعات در مورد کسب و کارهای محلی، شرکتهای تولید کننده نرم افزار و سازمانهای B2B تبدیل شده است. امار نشان می دهد که حدود 46% جستجوها در پی یافتن کالا یا خدمات در نزدیکی محل زندگی خود هستند و حدود 78% جستجوهایی که از طریق موبایل انجام می شوند، نهایتا منجر به خرید آفلاین می شوند.\r\n\r\nاگر در گذشته، افراد اطلاعات مورد نیاز خود را از یک دوست می گرفتند، امروزه این اطلاعات را از اینترنت درخواست می کنند، و این امر در مورد همه صنایع صحت دارد. بنابراین با ایجاد موقعیتی مناسب برای کسب و کارتان می توانید افرادی را که قبلاً هرگز نام شرکت شما را نشنیده بودند به مشتری تبدیل کنید.\r\n\r\nاگر وب سایت و محتوای خود را بهینه سازی نکنید، مهم نیست که چند نفر اصطلاحات و کلیدواژه های مربوط به کسب و کار شما را جستجو می کنند؛ سایت شما در نتایج نشان داده نخواهد شد و کسب و کارتان مورد توجه هیچ کس قرار نخواهد گرفت.\r\n\r\nاما وقتی سایتتان را برای پیدا شدن در نتایج جستجو بهینه سازی می کنید ، در واقع خود را روی نقشه قرار می دهید. مصرف کنندگان اصطلاحات و واژه های مرتبط را جستجو می کنند و سایت و کسب و کار شما را در نتایج جستجو می بینند.\r\n\r\nاگر کار بهینه سازی موتور جستجو یا سئو (SEO) را به خوبی انجام دهید ، مراجعه مشتریان به سایت شما به طور قابل توجهی افزایش خواهد یافت. اما تنها بهینه سازی موتور جستجو و افزایش آمار بازدید کنندگان سایت کافی نیست. اگر فقط تعداد بازدیدکنندگان سایت خود را افزایش دهید و محتوای سایت شما مورد توجه مشتریان بالقوه قرار نگیرد ، هیچ نتیجه مثبتی به دست نمی آورید. اگر محتوای سایت خوب نباشد، بازدیدکنندگان بدون اینکه خریدی داشته باشند سایت شما را ترک می کنند و هرگز بازنمی گردند. پس برای استفاده از ترافیکی که متوجه سایتتان میشود ، باید کاری کنید که محتوای سایتتان مورد توجه کاربران قرار بگیرد. همچنین لازم است که کارایی قیف های تبدیل (CONVERSION) خود را نیز بهینه کنید.\r\n\r\nکاربرد بهینه سازی وب سایت و نحوه کارکرد\r\nکاربرد بهینه سازی وب سایت و نحوه کارکرد\r\nکاربرد بهینه سازی وب سایت و نحوه کارکرد\r\nهدف از بهینه سازی وب سایت این است که سایت شما تا جایی که ممکن است هم برای موتورهای جستجو و هم برای افراد واقعی جذاب باشد. اما این کار را چگونه باید انجام داد؟\r\n\r\nاولین قدم برای بهینه سازی هر چیزی ، شناخت مشکلات آن است. قبل از اینکه بخواهید سایت خود را بهبود ببخشید ، باید بدانید که چه مشکلاتی در آن وجود دارد. این پایه و اساس فرآیند بهینه سازی سایت است. پس قبل از هر چیز، باید از ابزارها و نرم افزارهای موجود برای یافتن مشکلات احتمالی مرتبط با سئو ، سرعت صفحه ، شکل نمایش صفحات در موبایل و موارد دیگر استفاده کنید.\r\n\r\nدر پایان، لازم است که قابلیت استفاده از سایت خود را با کمک گرفتن از کاربرانی که مایل به تست کردن وبسایتتان هستند، ارزیابی کنید. نتایج این ارزیابی به شما کمک خواهند کرد که ساختار سایت و سایر مسائل مرتبط با سئو را بهبود ببخشید. همچنین طراحان سایت خواهند توانست UX سایت و شکل ظاهری آن را بهبود دهند.\r\n\r\n6 راهکار ضروری برای بهینه سازی وب سایت\r\n6 راهکار ضروری برای بهینه سازی وب سایت\r\n6 راهکار ضروری برای بهینه سازی وب سایت\r\nروش ها و استراتژی های مختلفی برای بهینه سازی یک وبسایت وجود دارد. اگر در گوگل عبارت ” improve your website ” را جستجو کنید، با بیش از سه میلیارد نتیجه جستجو مواجه خواهید شد. وقتی این همه اطلاعات برای بهبود بخشیدن یک وبسایت در دسترس است، شروع کار می تواند تا حدی چالش برانگیز باشد.\r\n\r\nما در این مقاله روی اصولی تمرکز خواهیم کرد که به شما کمک می کنند تا بهترین نتیجه را در زمینه بهینه سازی وبسایت خود به دست آورید. در ادامه، 6 استراتژی مهم شرح داده شده اند که به شما کمک می کنند تا وبسایت خود را از هر نظر بهینه سازی کنید.\r\n\r\n1. بهینه سازی سایت برای موبایل\r\nبهینه سازی سایت برای موبایل\r\nبهینه سازی سایت برای موبایل\r\nامروزه دیگر کافی نیست که وبسایتی داشته باشید که محتوای صفحاتش در صفحه لپتاپ و کامپیوترهای دسکتاپ به خوبی نمایش داده شود. اگر میخواهید در بازار آنلاین موفق باشید، باید بر روی نمایش سایت خود در موبایل نیز تمرکز کنید. آمار نشان می دهد که در سال 2018، بیشترین میزان بازدید از سایتها (52.2%) از طریق موبایل بوده است. این میزان بدون در نظر گرفتن جستجوهایی است که در گوگل، با استفاده از تلفنهای همراه هوشمند یا اسمارت فون انجام می شود. در سه ماهه سوم سال 2019، حدود 64% جستجوهای گوگل از طریق موبایل انجام شده است.\r\n\r\nبه دلیل استفاده فزاینده کاربران از موبایل، گوگل اولویت را بر نمایه کردن محتوای سایتهای موبایل (mobile-first indexing) قرار داده است. این به این معناست که در درجه اول، صفحاتی نمایه یا ایندکس می شوند و رتبه بالاتری می گیرند که برای موبایل بهینه سازی شده باشند. بنابراین، اگر سایت شما در نمایش موبایل مشکل داشته باشد، نه تنها تبدیلهای مرتبط با جستجو در موبایل را از دست می دهید، بلکه فرصت دستیابی به یک رتبه بالا در جستجوهای مربوطه نیز از دستتان می رود.\r\n\r\nپس اولین کاری که لازم است انجام دهید این است که سایت خود را در رابطه با قابلیت استفاده در دستگاههای موبایل تست کنید. برای این کار می توانید از ابزار Mobile-Friendly Test که متعلق به گوگل است استفاده کنید.\r\n\r\nبعد از انجام تست، هر مشکلی را که وجود دارد برطرف کنید. همچنین لازم است که تک تک صفحات سایت خود را بر روی مدلهای مختلف موبایل (با اندازه های گوناگون) تست کنید و مطمئن شوید که مشکلی وجود ندارد.\r\n\r\nاین کار را می توانید با استفاده گزینه Device Toolbar در Chrome Developer Tools انجام دهید. این گزینه به شما این امکان را می دهد که وب سایت خود را در صفحاتی با اندازه های مختلف ببینید.\r\n\r\nهنگام تست سایت خود در زمینه موبایل، حتما اطمینان حاصل کنید که:\r\n\r\nپنجره های پاپ‌آپ یا میان پرده ای در صفحه موبایل نشان داده نمی شوند\r\nسایت به سرعت و به طور صحیح بارگیری می شود.\r\nخواندن متن آسان است\r\nهمه مطالب قابل مشاهده هستند\r\nتصاویر و عناصر گرافیکی کوچک شده هنوز هم خوانا هستند.\r\nپیمایش سایت آسان است.\r\nاگر این اصول اولیه را رعایت کرده باشید ، حتما می توانید توجه موتورهای جستجو و کاربران را به سایت خود جلب کنید.\r\n\r\n2. بهینه سازی سرعت صفحه (Page Speed)\r\nبهینه سازی سرعت صفحه (Page Speed)\r\nبهینه سازی سرعت صفحه (Page Speed)\r\nهیچ کس دوست ندارد ساکت بنشیند و منتظر بماند تا اینکه یک صفحه از سایت شما بارگیری شود. زمان بارگذاری 5 ثانیه ای منجر به نرخ پرشی (bounce rate) برابر با 38% می شود؛ و البته هرچه زمان بارگذاری بیشتر طول بکشد ، نرخ پرش بالاتر می رود. اگر می خواهید کاربران تجربه خوبی از بازدید از وبسایت شما داشته باشند، باید سرعت سایت خود را بالا ببرید.\r\n\r\nسرعت صفحه یکی از عوامل اساسی رتبه بندی گوگل نیز هست و می تواند به طور مستقیم برسئو (SEO) سایت شما تأثیر بگذارد.\r\n\r\nبرای آگاهی از سرعت سایت و هرگونه مشکل احتمالی ، می توانید از ابزارهای رایگان آنلاین مانند Pingdom Website Speed ​​Test یاد Pagespeed Insights استفاده کنید. این ابزارها به سرعت وب سایت شما یک نمره می دهند ، تمام درخواست های HTTP را می شمرند و دسته بندی می کنند و مواردی را که می توانید اصلاح کنید، برایتان فهرست می کنند.\r\n\r\nبرخی از مشکلات رایج عبارتند از: داشتن فایلهای JS و CSS غیرفشرده ، نداشتن CDN ، عدم ذخیره صفحه برای سایتهای دارای سیستم CMS و وجود فایلهای تصویری بزرگ و غیربهینه.\r\n\r\nمشکلات مربوط به فشرده سازی و حافظه پنهان و کمبود CDN به راحتی با استفاده از پلاگین ها یا برنامه های افزودنی CMS برطرف می شوند. تصاویر را هم می توان با نرم افزارهای موجود برای فشرده سازی تصویر مانند Smush ، kraken.io ، Cloudinary یا ImageKit بهینه سازی کرد.\r\n\r\nبرنامه‌های هاستینگ اشتراکی ارزان قیمت و بی کیفیت نیز می تواند منجر به کند شدن بارگذاری صفحه شود. بنابراین اگر بعد از رسیدن به امتیاز 90+ در ابزارهای تست سرعت صفحه ، باز هم سرعت بارگیری صفحه کند است ، باید به فکر یک برنامه هاستینگ بهتر باشید.\r\n\r\nلیست زیر مجموعه ای از بهترین ابزارهای تست سرعت سایت را به شما معرفی می کند. این ابزارها به شما کمک می کنند تا مشکلات مربوط به بارگیری و سرعت صفحه را شناسایی کنید. همه این ابزارها رایگان هستند و برای استفاده از آنها، نیازی به ثبت نام وجود ندارد.\r\n\r\nPingdom Website Speed Test\r\nGoogle Pagespeed Insights\r\nGT Metrix\r\nWebPageTest\r\nUptrends Speed Test\r\nDareboost\r\n3. بهینه سازی موتور جستجو\r\nبهینه سازی موتور جستجو\r\nبهینه سازی موتور جستجو\r\nبهینه سازی برای موتورهای جستجو یکی از مهمترین و قدرتمندترین ابزارهای بازاریابی در اینترنت است. حدود70% از بازاریابان سئو را موثرتر از PPC می دانند. سئو فقط راهی برای جلب ترافیک نیست. مردم نتایج ارگانیک جستجو را به تبلیغات ترجیح می دهند و به آن اعتماد بیشتریی دارند. وقتی به طور ارگانیک در نتایج جستجو ظاهر میشوید، به این معناست که کیفییت محتوا و مرتبط بودن آن با جستجوی کاربر، مورد تایید گوگل است.\r\n\r\nاولین قدم برای بهبود سئو این است که مطمئن شوید گوگل تمام صفحات سایت را به درستی نمایه کرده است و هیچ خطایی درسئو وجود ندارد.\r\n\r\nاولین کاری که در این رابطه باید انجام دهید، ثبت نام در کنسول جستجوی گوگل (Google Search Console) و ثبت سایت است. کنسول جستجوی گوگل موارد اساسی سئو را برای شما برجسته می کند ، لیست صفحات نمایه شده را برایتان نمایش میدهد و با استفاده از آن می توانید بررسی کنید که صفحاتتان برای کدام کلیدواژه ها رتبه بندی شده اند.\r\n\r\nوقتی با استفاده از کنسول جستجوی گوگل موارد اصلی سئو را پوشش دادید، وقت آن است که به سراغ ابزارهای دیگر بروید و از تاکتیک ها و استراتژی های پیشرفته نیز استفاده کنید. برای گسترش دانسته ها و اطلاعاتتان در مورد سئو، می توانید از مطالب موجود در وبسایتهای زیر استفاده کنید:\r\n\r\nBacklinko\r\nAhrefs Blog\r\nSEMRush Blog\r\nMoz Blog\r\nSearch Engine Journal\r\nSearch Engine Land\r\nYoast\r\nCognitive SEO\r\nMatthew Woodward\r\nClickMinded\r\nبهینه سازی وبسایت برای موتور جستجو کاری نیست که یک روزه انجام شود. این کار چالش برانگیز نیاز به صرف زمان زیادی دارد. در ادامه، فهرستی از ابزارهای آنلاین جهت بهبود سئو آورده شده اند. برای استفاده از برخی از نرم افزارهای قابل دسترسی در اینترنت، نیاز است که ماهانه مبلغی را پرداخت کنید. ما در اینجا نرم افزارهای رایگان را مشخص کرده ایم.\r\n\r\nGoogle Search Console (رایگان)\r\nGoogle Ads Keyword Planner (رایگان)\r\nScreaming Frog SEO Spider (رایگان)\r\nAhrefs\r\nSEMRush\r\nMoz\r\nSpyFu\r\nMarketMuse', '11');

-- --------------------------------------------------------

--
-- Table structure for table `provinces`
--

CREATE TABLE `provinces` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` varchar(255) CHARACTER SET utf32 COLLATE utf32_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `provinces`
--

INSERT INTO `provinces` (`id`, `name`) VALUES
(1, 'آذربايجان شرقی'),
(2, 'آذربايجان غربی'),
(3, 'اردبيل'),
(4, 'اصفهان'),
(5, 'البرز'),
(6, 'ايلام'),
(7, 'بوشهر'),
(8, 'تهران'),
(9, 'چهارمحال بختياری'),
(10, 'خراسان جنوبي'),
(11, 'خراسان رضوي'),
(12, 'خراسان شمالی'),
(13, 'خوزستان'),
(14, 'زنجان'),
(15, 'سمنان'),
(16, 'سيستان و بلوچستان'),
(17, 'فارس'),
(18, 'قزوين'),
(19, 'قم'),
(20, 'كردستان'),
(21, 'كرمان'),
(22, 'كرمانشاه'),
(23, 'كهكيلويه و بويراحمد'),
(24, 'گلستان'),
(25, 'گيلان'),
(26, 'لرستان'),
(27, 'مازندران'),
(28, 'مركزي'),
(29, 'هرمزگان'),
(30, 'همدان'),
(31, 'يزد');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `cities`
--
ALTER TABLE `cities`
  ADD PRIMARY KEY (`id`),
  ADD KEY `cities_province_id_foreign` (`province_id`);

--
-- Indexes for table `logs`
--
ALTER TABLE `logs`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `members`
--
ALTER TABLE `members`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `username` (`username`),
  ADD UNIQUE KEY `nation_code` (`nation_code`);

--
-- Indexes for table `permissions`
--
ALTER TABLE `permissions`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `posts`
--
ALTER TABLE `posts`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `provinces`
--
ALTER TABLE `provinces`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `name` (`name`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `categories`
--
ALTER TABLE `categories`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `cities`
--
ALTER TABLE `cities`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=443;

--
-- AUTO_INCREMENT for table `logs`
--
ALTER TABLE `logs`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=52;

--
-- AUTO_INCREMENT for table `members`
--
ALTER TABLE `members`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=24;

--
-- AUTO_INCREMENT for table `posts`
--
ALTER TABLE `posts`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `provinces`
--
ALTER TABLE `provinces`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=38;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `cities`
--
ALTER TABLE `cities`
  ADD CONSTRAINT `cities_province_id_foreign` FOREIGN KEY (`province_id`) REFERENCES `provinces` (`id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
